Console.Clear();
Console.Write("Введите трёхзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());
int length = num.ToString().Length;
int result = 0;
if (length == 3){ //Если длина введённого числа равняется 3 цифрам , то делаем следующее
    result = num % 10; //Мы опять же обращаемся к остатку , условно 456 мы можем поделить 45 раз по 10, остаток 6 - это мы и будем просить выводить наш консоль в терминал.
    Console.WriteLine(result);
}
else {
    Console.WriteLine("Вы ввели не трёхзначное число, попробуйте снова.");
}


//Задача 7: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
//456 -> 6
//782 -> 2
//918 -> 8